____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_28 (InputLayer)            (None, 32, 32, 3)     0                                            
____________________________________________________________________________________________________
conv2d_277 (Conv2D)              (None, 30, 30, 4)     112         input_28[0][0]                   
____________________________________________________________________________________________________
conv2d_278 (Conv2D)              (None, 28, 28, 4)     148         conv2d_277[0][0]                 
____________________________________________________________________________________________________
conv2d_279 (Conv2D)              (None, 28, 28, 8)     296         conv2d_278[0][0]                 
____________________________________________________________________________________________________
max_pooling2d_38 (MaxPooling2D)  (None, 26, 26, 8)     0           conv2d_279[0][0]                 
____________________________________________________________________________________________________
conv2d_280 (Conv2D)              (None, 26, 26, 12)    876         conv2d_279[0][0]                 
____________________________________________________________________________________________________
merge_89 (Merge)                 (None, 26, 26, 20)    0           max_pooling2d_38[0][0]           
                                                                   conv2d_280[0][0]                 
____________________________________________________________________________________________________
conv2d_283 (Conv2D)              (None, 26, 26, 8)     168         merge_89[0][0]                   
____________________________________________________________________________________________________
conv2d_284 (Conv2D)              (None, 26, 26, 8)     456         conv2d_283[0][0]                 
____________________________________________________________________________________________________
conv2d_281 (Conv2D)              (None, 26, 26, 8)     168         merge_89[0][0]                   
____________________________________________________________________________________________________
conv2d_285 (Conv2D)              (None, 26, 26, 8)     456         conv2d_284[0][0]                 
____________________________________________________________________________________________________
conv2d_282 (Conv2D)              (None, 24, 24, 12)    876         conv2d_281[0][0]                 
____________________________________________________________________________________________________
conv2d_286 (Conv2D)              (None, 24, 24, 12)    876         conv2d_285[0][0]                 
____________________________________________________________________________________________________
merge_90 (Merge)                 (None, 24, 24, 24)    0           conv2d_282[0][0]                 
                                                                   conv2d_286[0][0]                 
____________________________________________________________________________________________________
conv2d_287 (Conv2D)              (None, 22, 22, 24)    5208        merge_90[0][0]                   
____________________________________________________________________________________________________
max_pooling2d_39 (MaxPooling2D)  (None, 22, 22, 24)    0           merge_90[0][0]                   
____________________________________________________________________________________________________
merge_91 (Merge)                 (None, 22, 22, 48)    0           conv2d_287[0][0]                 
                                                                   max_pooling2d_39[0][0]           
____________________________________________________________________________________________________
activation_168 (Activation)      (None, 22, 22, 48)    0           merge_91[0][0]                   
____________________________________________________________________________________________________
conv2d_291 (Conv2D)              (None, 22, 22, 4)     196         activation_168[0][0]             
____________________________________________________________________________________________________
conv2d_289 (Conv2D)              (None, 22, 22, 4)     196         activation_168[0][0]             
____________________________________________________________________________________________________
conv2d_292 (Conv2D)              (None, 22, 22, 6)     222         conv2d_291[0][0]                 
____________________________________________________________________________________________________
conv2d_288 (Conv2D)              (None, 22, 22, 4)     196         activation_168[0][0]             
____________________________________________________________________________________________________
conv2d_290 (Conv2D)              (None, 22, 22, 4)     148         conv2d_289[0][0]                 
____________________________________________________________________________________________________
conv2d_293 (Conv2D)              (None, 22, 22, 8)     440         conv2d_292[0][0]                 
____________________________________________________________________________________________________
merge_92 (Merge)                 (None, 22, 22, 16)    0           conv2d_288[0][0]                 
                                                                   conv2d_290[0][0]                 
                                                                   conv2d_293[0][0]                 
____________________________________________________________________________________________________
conv2d_294 (Conv2D)              (None, 22, 22, 48)    816         merge_92[0][0]                   
____________________________________________________________________________________________________
merge_93 (Merge)                 (None, 22, 22, 48)    0           activation_168[0][0]             
                                                                   conv2d_294[0][0]                 
____________________________________________________________________________________________________
activation_169 (Activation)      (None, 22, 22, 48)    0           merge_93[0][0]                   
____________________________________________________________________________________________________
conv2d_296 (Conv2D)              (None, 22, 22, 32)    1568        activation_169[0][0]             
____________________________________________________________________________________________________
conv2d_297 (Conv2D)              (None, 22, 22, 32)    9248        conv2d_296[0][0]                 
____________________________________________________________________________________________________
max_pooling2d_40 (MaxPooling2D)  (None, 10, 10, 48)    0           activation_169[0][0]             
____________________________________________________________________________________________________
conv2d_295 (Conv2D)              (None, 10, 10, 48)    20784       activation_169[0][0]             
____________________________________________________________________________________________________
conv2d_298 (Conv2D)              (None, 10, 10, 48)    13872       conv2d_297[0][0]                 
____________________________________________________________________________________________________
merge_94 (Merge)                 (None, 10, 10, 144)   0           max_pooling2d_40[0][0]           
                                                                   conv2d_295[0][0]                 
                                                                   conv2d_298[0][0]                 
____________________________________________________________________________________________________
conv2d_300 (Conv2D)              (None, 10, 10, 16)    2320        merge_94[0][0]                   
____________________________________________________________________________________________________
conv2d_301 (Conv2D)              (None, 10, 10, 20)    2260        conv2d_300[0][0]                 
____________________________________________________________________________________________________
conv2d_299 (Conv2D)              (None, 10, 10, 24)    3480        merge_94[0][0]                   
____________________________________________________________________________________________________
conv2d_302 (Conv2D)              (None, 10, 10, 24)    3384        conv2d_301[0][0]                 
____________________________________________________________________________________________________
merge_95 (Merge)                 (None, 10, 10, 48)    0           conv2d_299[0][0]                 
                                                                   conv2d_302[0][0]                 
____________________________________________________________________________________________________
conv2d_303 (Conv2D)              (None, 10, 10, 144)   7056        merge_95[0][0]                   
____________________________________________________________________________________________________
merge_96 (Merge)                 (None, 10, 10, 144)   0           merge_94[0][0]                   
                                                                   conv2d_303[0][0]                 
____________________________________________________________________________________________________
activation_170 (Activation)      (None, 10, 10, 144)   0           merge_96[0][0]                   
____________________________________________________________________________________________________
conv2d_308 (Conv2D)              (None, 10, 10, 32)    4640        activation_170[0][0]             
____________________________________________________________________________________________________
conv2d_304 (Conv2D)              (None, 10, 10, 32)    4640        activation_170[0][0]             
____________________________________________________________________________________________________
conv2d_306 (Conv2D)              (None, 10, 10, 32)    4640        activation_170[0][0]             
____________________________________________________________________________________________________
conv2d_309 (Conv2D)              (None, 10, 10, 36)    10404       conv2d_308[0][0]                 
____________________________________________________________________________________________________
max_pooling2d_41 (MaxPooling2D)  (None, 4, 4, 144)     0           activation_170[0][0]             
____________________________________________________________________________________________________
conv2d_305 (Conv2D)              (None, 4, 4, 36)      10404       conv2d_304[0][0]                 
____________________________________________________________________________________________________
conv2d_307 (Conv2D)              (None, 4, 4, 36)      10404       conv2d_306[0][0]                 
____________________________________________________________________________________________________
conv2d_310 (Conv2D)              (None, 4, 4, 40)      13000       conv2d_309[0][0]                 
____________________________________________________________________________________________________
merge_97 (Merge)                 (None, 4, 4, 256)     0           max_pooling2d_41[0][0]           
                                                                   conv2d_305[0][0]                 
                                                                   conv2d_307[0][0]                 
                                                                   conv2d_310[0][0]                 
____________________________________________________________________________________________________
conv2d_312 (Conv2D)              (None, 4, 4, 24)      6168        merge_97[0][0]                   
____________________________________________________________________________________________________
conv2d_313 (Conv2D)              (None, 4, 4, 28)      2044        conv2d_312[0][0]                 
____________________________________________________________________________________________________
conv2d_311 (Conv2D)              (None, 4, 4, 24)      6168        merge_97[0][0]                   
____________________________________________________________________________________________________
conv2d_314 (Conv2D)              (None, 4, 4, 32)      2720        conv2d_313[0][0]                 
____________________________________________________________________________________________________
merge_98 (Merge)                 (None, 4, 4, 56)      0           conv2d_311[0][0]                 
                                                                   conv2d_314[0][0]                 
____________________________________________________________________________________________________
conv2d_315 (Conv2D)              (None, 4, 4, 256)     14592       merge_98[0][0]                   
____________________________________________________________________________________________________
merge_99 (Merge)                 (None, 4, 4, 256)     0           merge_97[0][0]                   
                                                                   conv2d_315[0][0]                 
____________________________________________________________________________________________________
activation_171 (Activation)      (None, 4, 4, 256)     0           merge_99[0][0]                   
____________________________________________________________________________________________________
average_pooling2d_5 (AveragePool (None, 1, 1, 256)     0           activation_171[0][0]             
____________________________________________________________________________________________________
dropout_5 (Dropout)              (None, 1, 1, 256)     0           average_pooling2d_5[0][0]        
____________________________________________________________________________________________________
flatten_5 (Flatten)              (None, 256)           0           dropout_5[0][0]                  
____________________________________________________________________________________________________
dense_5 (Dense)                  (None, 10)            2570        flatten_5[0][0]                  
====================================================================================================
Total params: 168,220
Trainable params: 168,220
Non-trainable params: 0
____________________________________________________________________________________________________
