____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_33 (InputLayer)            (None, 32, 32, 3)     0                                            
____________________________________________________________________________________________________
conv2d_397 (Conv2D)              (None, 30, 30, 4)     112         input_33[0][0]                   
____________________________________________________________________________________________________
conv2d_398 (Conv2D)              (None, 28, 28, 4)     148         conv2d_397[0][0]                 
____________________________________________________________________________________________________
conv2d_399 (Conv2D)              (None, 28, 28, 8)     296         conv2d_398[0][0]                 
____________________________________________________________________________________________________
max_pooling2d_50 (MaxPooling2D)  (None, 26, 26, 8)     0           conv2d_399[0][0]                 
____________________________________________________________________________________________________
conv2d_400 (Conv2D)              (None, 26, 26, 12)    876         conv2d_399[0][0]                 
____________________________________________________________________________________________________
merge_1 (Merge)                  (None, 26, 26, 20)    0           max_pooling2d_50[0][0]           
                                                                   conv2d_400[0][0]                 
____________________________________________________________________________________________________
conv2d_403 (Conv2D)              (None, 26, 26, 8)     168         merge_1[0][0]                    
____________________________________________________________________________________________________
conv2d_404 (Conv2D)              (None, 26, 26, 8)     456         conv2d_403[0][0]                 
____________________________________________________________________________________________________
conv2d_401 (Conv2D)              (None, 26, 26, 8)     168         merge_1[0][0]                    
____________________________________________________________________________________________________
conv2d_405 (Conv2D)              (None, 26, 26, 8)     456         conv2d_404[0][0]                 
____________________________________________________________________________________________________
conv2d_402 (Conv2D)              (None, 24, 24, 12)    876         conv2d_401[0][0]                 
____________________________________________________________________________________________________
conv2d_406 (Conv2D)              (None, 24, 24, 12)    876         conv2d_405[0][0]                 
____________________________________________________________________________________________________
merge_2 (Merge)                  (None, 24, 24, 24)    0           conv2d_402[0][0]                 
                                                                   conv2d_406[0][0]                 
____________________________________________________________________________________________________
conv2d_407 (Conv2D)              (None, 22, 22, 24)    5208        merge_2[0][0]                    
____________________________________________________________________________________________________
max_pooling2d_51 (MaxPooling2D)  (None, 22, 22, 24)    0           merge_2[0][0]                    
____________________________________________________________________________________________________
merge_3 (Merge)                  (None, 22, 22, 48)    0           conv2d_407[0][0]                 
                                                                   max_pooling2d_51[0][0]           
____________________________________________________________________________________________________
activation_183 (Activation)      (None, 22, 22, 48)    0           merge_3[0][0]                    
____________________________________________________________________________________________________
conv2d_411 (Conv2D)              (None, 22, 22, 4)     196         activation_183[0][0]             
____________________________________________________________________________________________________
conv2d_409 (Conv2D)              (None, 22, 22, 4)     196         activation_183[0][0]             
____________________________________________________________________________________________________
conv2d_412 (Conv2D)              (None, 22, 22, 6)     222         conv2d_411[0][0]                 
____________________________________________________________________________________________________
conv2d_408 (Conv2D)              (None, 22, 22, 4)     196         activation_183[0][0]             
____________________________________________________________________________________________________
conv2d_410 (Conv2D)              (None, 22, 22, 4)     148         conv2d_409[0][0]                 
____________________________________________________________________________________________________
conv2d_413 (Conv2D)              (None, 22, 22, 8)     440         conv2d_412[0][0]                 
____________________________________________________________________________________________________
merge_4 (Merge)                  (None, 22, 22, 16)    0           conv2d_408[0][0]                 
                                                                   conv2d_410[0][0]                 
                                                                   conv2d_413[0][0]                 
____________________________________________________________________________________________________
conv2d_414 (Conv2D)              (None, 22, 22, 48)    816         merge_4[0][0]                    
____________________________________________________________________________________________________
merge_5 (Merge)                  (None, 22, 22, 48)    0           activation_183[0][0]             
                                                                   conv2d_414[0][0]                 
____________________________________________________________________________________________________
activation_184 (Activation)      (None, 22, 22, 48)    0           merge_5[0][0]                    
____________________________________________________________________________________________________
conv2d_416 (Conv2D)              (None, 22, 22, 32)    1568        activation_184[0][0]             
____________________________________________________________________________________________________
conv2d_417 (Conv2D)              (None, 22, 22, 32)    9248        conv2d_416[0][0]                 
____________________________________________________________________________________________________
max_pooling2d_52 (MaxPooling2D)  (None, 10, 10, 48)    0           activation_184[0][0]             
____________________________________________________________________________________________________
conv2d_415 (Conv2D)              (None, 10, 10, 48)    20784       activation_184[0][0]             
____________________________________________________________________________________________________
conv2d_418 (Conv2D)              (None, 10, 10, 48)    13872       conv2d_417[0][0]                 
____________________________________________________________________________________________________
merge_6 (Merge)                  (None, 10, 10, 144)   0           max_pooling2d_52[0][0]           
                                                                   conv2d_415[0][0]                 
                                                                   conv2d_418[0][0]                 
____________________________________________________________________________________________________
conv2d_420 (Conv2D)              (None, 10, 10, 16)    2320        merge_6[0][0]                    
____________________________________________________________________________________________________
conv2d_421 (Conv2D)              (None, 10, 10, 20)    2260        conv2d_420[0][0]                 
____________________________________________________________________________________________________
conv2d_419 (Conv2D)              (None, 10, 10, 24)    3480        merge_6[0][0]                    
____________________________________________________________________________________________________
conv2d_422 (Conv2D)              (None, 10, 10, 24)    3384        conv2d_421[0][0]                 
____________________________________________________________________________________________________
merge_7 (Merge)                  (None, 10, 10, 48)    0           conv2d_419[0][0]                 
                                                                   conv2d_422[0][0]                 
____________________________________________________________________________________________________
conv2d_423 (Conv2D)              (None, 10, 10, 144)   7056        merge_7[0][0]                    
____________________________________________________________________________________________________
merge_8 (Merge)                  (None, 10, 10, 144)   0           merge_6[0][0]                    
                                                                   conv2d_423[0][0]                 
____________________________________________________________________________________________________
activation_185 (Activation)      (None, 10, 10, 144)   0           merge_8[0][0]                    
____________________________________________________________________________________________________
conv2d_428 (Conv2D)              (None, 10, 10, 32)    4640        activation_185[0][0]             
____________________________________________________________________________________________________
conv2d_424 (Conv2D)              (None, 10, 10, 32)    4640        activation_185[0][0]             
____________________________________________________________________________________________________
conv2d_426 (Conv2D)              (None, 10, 10, 32)    4640        activation_185[0][0]             
____________________________________________________________________________________________________
conv2d_429 (Conv2D)              (None, 10, 10, 36)    10404       conv2d_428[0][0]                 
____________________________________________________________________________________________________
max_pooling2d_53 (MaxPooling2D)  (None, 4, 4, 144)     0           activation_185[0][0]             
____________________________________________________________________________________________________
conv2d_425 (Conv2D)              (None, 4, 4, 36)      10404       conv2d_424[0][0]                 
____________________________________________________________________________________________________
conv2d_427 (Conv2D)              (None, 4, 4, 36)      10404       conv2d_426[0][0]                 
____________________________________________________________________________________________________
conv2d_430 (Conv2D)              (None, 4, 4, 40)      13000       conv2d_429[0][0]                 
____________________________________________________________________________________________________
merge_9 (Merge)                  (None, 4, 4, 256)     0           max_pooling2d_53[0][0]           
                                                                   conv2d_425[0][0]                 
                                                                   conv2d_427[0][0]                 
                                                                   conv2d_430[0][0]                 
____________________________________________________________________________________________________
conv2d_432 (Conv2D)              (None, 4, 4, 24)      6168        merge_9[0][0]                    
____________________________________________________________________________________________________
conv2d_433 (Conv2D)              (None, 4, 4, 28)      2044        conv2d_432[0][0]                 
____________________________________________________________________________________________________
conv2d_431 (Conv2D)              (None, 4, 4, 24)      6168        merge_9[0][0]                    
____________________________________________________________________________________________________
conv2d_434 (Conv2D)              (None, 4, 4, 32)      2720        conv2d_433[0][0]                 
____________________________________________________________________________________________________
merge_10 (Merge)                 (None, 4, 4, 56)      0           conv2d_431[0][0]                 
                                                                   conv2d_434[0][0]                 
____________________________________________________________________________________________________
conv2d_435 (Conv2D)              (None, 4, 4, 256)     14592       merge_10[0][0]                   
____________________________________________________________________________________________________
merge_11 (Merge)                 (None, 4, 4, 256)     0           merge_9[0][0]                    
                                                                   conv2d_435[0][0]                 
____________________________________________________________________________________________________
activation_186 (Activation)      (None, 4, 4, 256)     0           merge_11[0][0]                   
____________________________________________________________________________________________________
average_pooling2d_8 (AveragePool (None, 1, 1, 256)     0           activation_186[0][0]             
____________________________________________________________________________________________________
dropout_8 (Dropout)              (None, 1, 1, 256)     0           average_pooling2d_8[0][0]        
____________________________________________________________________________________________________
flatten_8 (Flatten)              (None, 256)           0           dropout_8[0][0]                  
____________________________________________________________________________________________________
dense_8 (Dense)                  (None, 10)            2570        flatten_8[0][0]                  
====================================================================================================
Total params: 168,220
Trainable params: 168,220
Non-trainable params: 0
____________________________________________________________________________________________________
