____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_32 (InputLayer)            (None, 32, 32, 3)     0                                            
____________________________________________________________________________________________________
conv2d_319 (Conv2D)              (None, 30, 30, 4)     112         input_32[0][0]                   
____________________________________________________________________________________________________
conv2d_320 (Conv2D)              (None, 28, 28, 4)     148         conv2d_319[0][0]                 
____________________________________________________________________________________________________
conv2d_321 (Conv2D)              (None, 28, 28, 8)     296         conv2d_320[0][0]                 
____________________________________________________________________________________________________
max_pooling2d_42 (MaxPooling2D)  (None, 26, 26, 8)     0           conv2d_321[0][0]                 
____________________________________________________________________________________________________
conv2d_322 (Conv2D)              (None, 26, 26, 12)    876         conv2d_321[0][0]                 
____________________________________________________________________________________________________
merge_100 (Merge)                (None, 26, 26, 20)    0           max_pooling2d_42[0][0]           
                                                                   conv2d_322[0][0]                 
____________________________________________________________________________________________________
conv2d_325 (Conv2D)              (None, 26, 26, 8)     168         merge_100[0][0]                  
____________________________________________________________________________________________________
conv2d_326 (Conv2D)              (None, 26, 26, 8)     456         conv2d_325[0][0]                 
____________________________________________________________________________________________________
conv2d_323 (Conv2D)              (None, 26, 26, 8)     168         merge_100[0][0]                  
____________________________________________________________________________________________________
conv2d_327 (Conv2D)              (None, 26, 26, 8)     456         conv2d_326[0][0]                 
____________________________________________________________________________________________________
conv2d_324 (Conv2D)              (None, 24, 24, 12)    876         conv2d_323[0][0]                 
____________________________________________________________________________________________________
conv2d_328 (Conv2D)              (None, 24, 24, 12)    876         conv2d_327[0][0]                 
____________________________________________________________________________________________________
merge_101 (Merge)                (None, 24, 24, 24)    0           conv2d_324[0][0]                 
                                                                   conv2d_328[0][0]                 
____________________________________________________________________________________________________
conv2d_329 (Conv2D)              (None, 22, 22, 24)    5208        merge_101[0][0]                  
____________________________________________________________________________________________________
max_pooling2d_43 (MaxPooling2D)  (None, 22, 22, 24)    0           merge_101[0][0]                  
____________________________________________________________________________________________________
merge_102 (Merge)                (None, 22, 22, 48)    0           conv2d_329[0][0]                 
                                                                   max_pooling2d_43[0][0]           
____________________________________________________________________________________________________
activation_175 (Activation)      (None, 22, 22, 48)    0           merge_102[0][0]                  
____________________________________________________________________________________________________
conv2d_333 (Conv2D)              (None, 22, 22, 4)     196         activation_175[0][0]             
____________________________________________________________________________________________________
conv2d_331 (Conv2D)              (None, 22, 22, 4)     196         activation_175[0][0]             
____________________________________________________________________________________________________
conv2d_334 (Conv2D)              (None, 22, 22, 6)     222         conv2d_333[0][0]                 
____________________________________________________________________________________________________
conv2d_330 (Conv2D)              (None, 22, 22, 4)     196         activation_175[0][0]             
____________________________________________________________________________________________________
conv2d_332 (Conv2D)              (None, 22, 22, 4)     148         conv2d_331[0][0]                 
____________________________________________________________________________________________________
conv2d_335 (Conv2D)              (None, 22, 22, 8)     440         conv2d_334[0][0]                 
____________________________________________________________________________________________________
merge_103 (Merge)                (None, 22, 22, 16)    0           conv2d_330[0][0]                 
                                                                   conv2d_332[0][0]                 
                                                                   conv2d_335[0][0]                 
____________________________________________________________________________________________________
conv2d_336 (Conv2D)              (None, 22, 22, 48)    816         merge_103[0][0]                  
____________________________________________________________________________________________________
merge_104 (Merge)                (None, 22, 22, 48)    0           activation_175[0][0]             
                                                                   conv2d_336[0][0]                 
____________________________________________________________________________________________________
activation_176 (Activation)      (None, 22, 22, 48)    0           merge_104[0][0]                  
____________________________________________________________________________________________________
conv2d_338 (Conv2D)              (None, 22, 22, 32)    1568        activation_176[0][0]             
____________________________________________________________________________________________________
conv2d_339 (Conv2D)              (None, 22, 22, 32)    9248        conv2d_338[0][0]                 
____________________________________________________________________________________________________
max_pooling2d_44 (MaxPooling2D)  (None, 10, 10, 48)    0           activation_176[0][0]             
____________________________________________________________________________________________________
conv2d_337 (Conv2D)              (None, 10, 10, 48)    20784       activation_176[0][0]             
____________________________________________________________________________________________________
conv2d_340 (Conv2D)              (None, 10, 10, 48)    13872       conv2d_339[0][0]                 
____________________________________________________________________________________________________
merge_105 (Merge)                (None, 10, 10, 144)   0           max_pooling2d_44[0][0]           
                                                                   conv2d_337[0][0]                 
                                                                   conv2d_340[0][0]                 
____________________________________________________________________________________________________
conv2d_342 (Conv2D)              (None, 10, 10, 16)    2320        merge_105[0][0]                  
____________________________________________________________________________________________________
conv2d_343 (Conv2D)              (None, 10, 10, 20)    2260        conv2d_342[0][0]                 
____________________________________________________________________________________________________
conv2d_341 (Conv2D)              (None, 10, 10, 24)    3480        merge_105[0][0]                  
____________________________________________________________________________________________________
conv2d_344 (Conv2D)              (None, 10, 10, 24)    3384        conv2d_343[0][0]                 
____________________________________________________________________________________________________
merge_106 (Merge)                (None, 10, 10, 48)    0           conv2d_341[0][0]                 
                                                                   conv2d_344[0][0]                 
____________________________________________________________________________________________________
conv2d_345 (Conv2D)              (None, 10, 10, 144)   7056        merge_106[0][0]                  
____________________________________________________________________________________________________
merge_107 (Merge)                (None, 10, 10, 144)   0           merge_105[0][0]                  
                                                                   conv2d_345[0][0]                 
____________________________________________________________________________________________________
activation_177 (Activation)      (None, 10, 10, 144)   0           merge_107[0][0]                  
____________________________________________________________________________________________________
conv2d_350 (Conv2D)              (None, 10, 10, 32)    4640        activation_177[0][0]             
____________________________________________________________________________________________________
conv2d_346 (Conv2D)              (None, 10, 10, 32)    4640        activation_177[0][0]             
____________________________________________________________________________________________________
conv2d_348 (Conv2D)              (None, 10, 10, 32)    4640        activation_177[0][0]             
____________________________________________________________________________________________________
conv2d_351 (Conv2D)              (None, 10, 10, 36)    10404       conv2d_350[0][0]                 
____________________________________________________________________________________________________
max_pooling2d_45 (MaxPooling2D)  (None, 4, 4, 144)     0           activation_177[0][0]             
____________________________________________________________________________________________________
conv2d_347 (Conv2D)              (None, 4, 4, 36)      10404       conv2d_346[0][0]                 
____________________________________________________________________________________________________
conv2d_349 (Conv2D)              (None, 4, 4, 36)      10404       conv2d_348[0][0]                 
____________________________________________________________________________________________________
conv2d_352 (Conv2D)              (None, 4, 4, 40)      13000       conv2d_351[0][0]                 
____________________________________________________________________________________________________
merge_108 (Merge)                (None, 4, 4, 256)     0           max_pooling2d_45[0][0]           
                                                                   conv2d_347[0][0]                 
                                                                   conv2d_349[0][0]                 
                                                                   conv2d_352[0][0]                 
____________________________________________________________________________________________________
conv2d_354 (Conv2D)              (None, 4, 4, 24)      6168        merge_108[0][0]                  
____________________________________________________________________________________________________
conv2d_355 (Conv2D)              (None, 4, 4, 28)      2044        conv2d_354[0][0]                 
____________________________________________________________________________________________________
conv2d_353 (Conv2D)              (None, 4, 4, 24)      6168        merge_108[0][0]                  
____________________________________________________________________________________________________
conv2d_356 (Conv2D)              (None, 4, 4, 32)      2720        conv2d_355[0][0]                 
____________________________________________________________________________________________________
merge_109 (Merge)                (None, 4, 4, 56)      0           conv2d_353[0][0]                 
                                                                   conv2d_356[0][0]                 
____________________________________________________________________________________________________
conv2d_357 (Conv2D)              (None, 4, 4, 256)     14592       merge_109[0][0]                  
____________________________________________________________________________________________________
merge_110 (Merge)                (None, 4, 4, 256)     0           merge_108[0][0]                  
                                                                   conv2d_357[0][0]                 
____________________________________________________________________________________________________
activation_178 (Activation)      (None, 4, 4, 256)     0           merge_110[0][0]                  
____________________________________________________________________________________________________
average_pooling2d_6 (AveragePool (None, 1, 1, 256)     0           activation_178[0][0]             
____________________________________________________________________________________________________
dropout_6 (Dropout)              (None, 1, 1, 256)     0           average_pooling2d_6[0][0]        
____________________________________________________________________________________________________
flatten_6 (Flatten)              (None, 256)           0           dropout_6[0][0]                  
____________________________________________________________________________________________________
dense_6 (Dense)                  (None, 10)            2570        flatten_6[0][0]                  
====================================================================================================
Total params: 168,220
Trainable params: 168,220
Non-trainable params: 0
____________________________________________________________________________________________________
