____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_28 (InputLayer)            (None, 32, 32, 3)     0                                            
____________________________________________________________________________________________________
conv2d_238 (Conv2D)              (None, 30, 30, 4)     112         input_28[0][0]                   
____________________________________________________________________________________________________
conv2d_239 (Conv2D)              (None, 28, 28, 4)     148         conv2d_238[0][0]                 
____________________________________________________________________________________________________
conv2d_240 (Conv2D)              (None, 28, 28, 8)     296         conv2d_239[0][0]                 
____________________________________________________________________________________________________
max_pooling2d_34 (MaxPooling2D)  (None, 26, 26, 8)     0           conv2d_240[0][0]                 
____________________________________________________________________________________________________
conv2d_241 (Conv2D)              (None, 26, 26, 12)    876         conv2d_240[0][0]                 
____________________________________________________________________________________________________
merge_78 (Merge)                 (None, 26, 26, 20)    0           max_pooling2d_34[0][0]           
                                                                   conv2d_241[0][0]                 
____________________________________________________________________________________________________
conv2d_244 (Conv2D)              (None, 26, 26, 8)     168         merge_78[0][0]                   
____________________________________________________________________________________________________
conv2d_245 (Conv2D)              (None, 26, 26, 8)     456         conv2d_244[0][0]                 
____________________________________________________________________________________________________
conv2d_242 (Conv2D)              (None, 26, 26, 8)     168         merge_78[0][0]                   
____________________________________________________________________________________________________
conv2d_246 (Conv2D)              (None, 26, 26, 8)     456         conv2d_245[0][0]                 
____________________________________________________________________________________________________
conv2d_243 (Conv2D)              (None, 24, 24, 12)    876         conv2d_242[0][0]                 
____________________________________________________________________________________________________
conv2d_247 (Conv2D)              (None, 24, 24, 12)    876         conv2d_246[0][0]                 
____________________________________________________________________________________________________
merge_79 (Merge)                 (None, 24, 24, 24)    0           conv2d_243[0][0]                 
                                                                   conv2d_247[0][0]                 
____________________________________________________________________________________________________
conv2d_248 (Conv2D)              (None, 22, 22, 24)    5208        merge_79[0][0]                   
____________________________________________________________________________________________________
max_pooling2d_35 (MaxPooling2D)  (None, 22, 22, 24)    0           merge_79[0][0]                   
____________________________________________________________________________________________________
merge_80 (Merge)                 (None, 22, 22, 48)    0           conv2d_248[0][0]                 
                                                                   max_pooling2d_35[0][0]           
____________________________________________________________________________________________________
activation_164 (Activation)      (None, 22, 22, 48)    0           merge_80[0][0]                   
____________________________________________________________________________________________________
conv2d_252 (Conv2D)              (None, 22, 22, 4)     196         activation_164[0][0]             
____________________________________________________________________________________________________
conv2d_250 (Conv2D)              (None, 22, 22, 4)     196         activation_164[0][0]             
____________________________________________________________________________________________________
conv2d_253 (Conv2D)              (None, 22, 22, 6)     222         conv2d_252[0][0]                 
____________________________________________________________________________________________________
conv2d_249 (Conv2D)              (None, 22, 22, 4)     196         activation_164[0][0]             
____________________________________________________________________________________________________
conv2d_251 (Conv2D)              (None, 22, 22, 4)     148         conv2d_250[0][0]                 
____________________________________________________________________________________________________
conv2d_254 (Conv2D)              (None, 22, 22, 8)     440         conv2d_253[0][0]                 
____________________________________________________________________________________________________
merge_81 (Merge)                 (None, 22, 22, 16)    0           conv2d_249[0][0]                 
                                                                   conv2d_251[0][0]                 
                                                                   conv2d_254[0][0]                 
____________________________________________________________________________________________________
conv2d_255 (Conv2D)              (None, 22, 22, 48)    816         merge_81[0][0]                   
____________________________________________________________________________________________________
merge_82 (Merge)                 (None, 22, 22, 48)    0           activation_164[0][0]             
                                                                   conv2d_255[0][0]                 
____________________________________________________________________________________________________
activation_165 (Activation)      (None, 22, 22, 48)    0           merge_82[0][0]                   
____________________________________________________________________________________________________
conv2d_257 (Conv2D)              (None, 22, 22, 32)    1568        activation_165[0][0]             
____________________________________________________________________________________________________
conv2d_258 (Conv2D)              (None, 22, 22, 32)    9248        conv2d_257[0][0]                 
____________________________________________________________________________________________________
max_pooling2d_36 (MaxPooling2D)  (None, 10, 10, 48)    0           activation_165[0][0]             
____________________________________________________________________________________________________
conv2d_256 (Conv2D)              (None, 10, 10, 48)    20784       activation_165[0][0]             
____________________________________________________________________________________________________
conv2d_259 (Conv2D)              (None, 10, 10, 48)    13872       conv2d_258[0][0]                 
____________________________________________________________________________________________________
merge_83 (Merge)                 (None, 10, 10, 144)   0           max_pooling2d_36[0][0]           
                                                                   conv2d_256[0][0]                 
                                                                   conv2d_259[0][0]                 
____________________________________________________________________________________________________
conv2d_261 (Conv2D)              (None, 10, 10, 16)    2320        merge_83[0][0]                   
____________________________________________________________________________________________________
conv2d_262 (Conv2D)              (None, 10, 10, 20)    2260        conv2d_261[0][0]                 
____________________________________________________________________________________________________
conv2d_260 (Conv2D)              (None, 10, 10, 24)    3480        merge_83[0][0]                   
____________________________________________________________________________________________________
conv2d_263 (Conv2D)              (None, 10, 10, 24)    3384        conv2d_262[0][0]                 
____________________________________________________________________________________________________
merge_84 (Merge)                 (None, 10, 10, 48)    0           conv2d_260[0][0]                 
                                                                   conv2d_263[0][0]                 
____________________________________________________________________________________________________
conv2d_264 (Conv2D)              (None, 10, 10, 144)   7056        merge_84[0][0]                   
____________________________________________________________________________________________________
merge_85 (Merge)                 (None, 10, 10, 144)   0           merge_83[0][0]                   
                                                                   conv2d_264[0][0]                 
____________________________________________________________________________________________________
activation_166 (Activation)      (None, 10, 10, 144)   0           merge_85[0][0]                   
____________________________________________________________________________________________________
conv2d_269 (Conv2D)              (None, 10, 10, 32)    4640        activation_166[0][0]             
____________________________________________________________________________________________________
conv2d_265 (Conv2D)              (None, 10, 10, 32)    4640        activation_166[0][0]             
____________________________________________________________________________________________________
conv2d_267 (Conv2D)              (None, 10, 10, 32)    4640        activation_166[0][0]             
____________________________________________________________________________________________________
conv2d_270 (Conv2D)              (None, 10, 10, 36)    10404       conv2d_269[0][0]                 
____________________________________________________________________________________________________
max_pooling2d_37 (MaxPooling2D)  (None, 4, 4, 144)     0           activation_166[0][0]             
____________________________________________________________________________________________________
conv2d_266 (Conv2D)              (None, 4, 4, 36)      10404       conv2d_265[0][0]                 
____________________________________________________________________________________________________
conv2d_268 (Conv2D)              (None, 4, 4, 36)      10404       conv2d_267[0][0]                 
____________________________________________________________________________________________________
conv2d_271 (Conv2D)              (None, 4, 4, 40)      13000       conv2d_270[0][0]                 
____________________________________________________________________________________________________
merge_86 (Merge)                 (None, 4, 4, 256)     0           max_pooling2d_37[0][0]           
                                                                   conv2d_266[0][0]                 
                                                                   conv2d_268[0][0]                 
                                                                   conv2d_271[0][0]                 
____________________________________________________________________________________________________
conv2d_273 (Conv2D)              (None, 4, 4, 24)      6168        merge_86[0][0]                   
____________________________________________________________________________________________________
conv2d_274 (Conv2D)              (None, 4, 4, 28)      2044        conv2d_273[0][0]                 
____________________________________________________________________________________________________
conv2d_272 (Conv2D)              (None, 4, 4, 24)      6168        merge_86[0][0]                   
____________________________________________________________________________________________________
conv2d_275 (Conv2D)              (None, 4, 4, 32)      2720        conv2d_274[0][0]                 
____________________________________________________________________________________________________
merge_87 (Merge)                 (None, 4, 4, 56)      0           conv2d_272[0][0]                 
                                                                   conv2d_275[0][0]                 
____________________________________________________________________________________________________
conv2d_276 (Conv2D)              (None, 4, 4, 256)     14592       merge_87[0][0]                   
____________________________________________________________________________________________________
merge_88 (Merge)                 (None, 4, 4, 256)     0           merge_86[0][0]                   
                                                                   conv2d_276[0][0]                 
____________________________________________________________________________________________________
activation_167 (Activation)      (None, 4, 4, 256)     0           merge_88[0][0]                   
____________________________________________________________________________________________________
average_pooling2d_4 (AveragePool (None, 1, 1, 256)     0           activation_167[0][0]             
____________________________________________________________________________________________________
dropout_4 (Dropout)              (None, 1, 1, 256)     0           average_pooling2d_4[0][0]        
____________________________________________________________________________________________________
flatten_4 (Flatten)              (None, 256)           0           dropout_4[0][0]                  
____________________________________________________________________________________________________
dense_4 (Dense)                  (None, 10)            2570        flatten_4[0][0]                  
====================================================================================================
Total params: 168,220
Trainable params: 168,220
Non-trainable params: 0
____________________________________________________________________________________________________
