____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_32 (InputLayer)            (None, 32, 32, 3)     0                                            
____________________________________________________________________________________________________
conv2d_358 (Conv2D)              (None, 30, 30, 4)     112         input_32[0][0]                   
____________________________________________________________________________________________________
conv2d_359 (Conv2D)              (None, 28, 28, 4)     148         conv2d_358[0][0]                 
____________________________________________________________________________________________________
conv2d_360 (Conv2D)              (None, 28, 28, 8)     296         conv2d_359[0][0]                 
____________________________________________________________________________________________________
max_pooling2d_46 (MaxPooling2D)  (None, 26, 26, 8)     0           conv2d_360[0][0]                 
____________________________________________________________________________________________________
conv2d_361 (Conv2D)              (None, 26, 26, 12)    876         conv2d_360[0][0]                 
____________________________________________________________________________________________________
merge_1 (Merge)                  (None, 26, 26, 20)    0           max_pooling2d_46[0][0]           
                                                                   conv2d_361[0][0]                 
____________________________________________________________________________________________________
conv2d_364 (Conv2D)              (None, 26, 26, 8)     168         merge_1[0][0]                    
____________________________________________________________________________________________________
conv2d_365 (Conv2D)              (None, 26, 26, 8)     456         conv2d_364[0][0]                 
____________________________________________________________________________________________________
conv2d_362 (Conv2D)              (None, 26, 26, 8)     168         merge_1[0][0]                    
____________________________________________________________________________________________________
conv2d_366 (Conv2D)              (None, 26, 26, 8)     456         conv2d_365[0][0]                 
____________________________________________________________________________________________________
conv2d_363 (Conv2D)              (None, 24, 24, 12)    876         conv2d_362[0][0]                 
____________________________________________________________________________________________________
conv2d_367 (Conv2D)              (None, 24, 24, 12)    876         conv2d_366[0][0]                 
____________________________________________________________________________________________________
merge_2 (Merge)                  (None, 24, 24, 24)    0           conv2d_363[0][0]                 
                                                                   conv2d_367[0][0]                 
____________________________________________________________________________________________________
conv2d_368 (Conv2D)              (None, 22, 22, 24)    5208        merge_2[0][0]                    
____________________________________________________________________________________________________
max_pooling2d_47 (MaxPooling2D)  (None, 22, 22, 24)    0           merge_2[0][0]                    
____________________________________________________________________________________________________
merge_3 (Merge)                  (None, 22, 22, 48)    0           conv2d_368[0][0]                 
                                                                   max_pooling2d_47[0][0]           
____________________________________________________________________________________________________
activation_179 (Activation)      (None, 22, 22, 48)    0           merge_3[0][0]                    
____________________________________________________________________________________________________
conv2d_372 (Conv2D)              (None, 22, 22, 4)     196         activation_179[0][0]             
____________________________________________________________________________________________________
conv2d_370 (Conv2D)              (None, 22, 22, 4)     196         activation_179[0][0]             
____________________________________________________________________________________________________
conv2d_373 (Conv2D)              (None, 22, 22, 6)     222         conv2d_372[0][0]                 
____________________________________________________________________________________________________
conv2d_369 (Conv2D)              (None, 22, 22, 4)     196         activation_179[0][0]             
____________________________________________________________________________________________________
conv2d_371 (Conv2D)              (None, 22, 22, 4)     148         conv2d_370[0][0]                 
____________________________________________________________________________________________________
conv2d_374 (Conv2D)              (None, 22, 22, 8)     440         conv2d_373[0][0]                 
____________________________________________________________________________________________________
merge_4 (Merge)                  (None, 22, 22, 16)    0           conv2d_369[0][0]                 
                                                                   conv2d_371[0][0]                 
                                                                   conv2d_374[0][0]                 
____________________________________________________________________________________________________
conv2d_375 (Conv2D)              (None, 22, 22, 48)    816         merge_4[0][0]                    
____________________________________________________________________________________________________
merge_5 (Merge)                  (None, 22, 22, 48)    0           activation_179[0][0]             
                                                                   conv2d_375[0][0]                 
____________________________________________________________________________________________________
activation_180 (Activation)      (None, 22, 22, 48)    0           merge_5[0][0]                    
____________________________________________________________________________________________________
conv2d_377 (Conv2D)              (None, 22, 22, 32)    1568        activation_180[0][0]             
____________________________________________________________________________________________________
conv2d_378 (Conv2D)              (None, 22, 22, 32)    9248        conv2d_377[0][0]                 
____________________________________________________________________________________________________
max_pooling2d_48 (MaxPooling2D)  (None, 10, 10, 48)    0           activation_180[0][0]             
____________________________________________________________________________________________________
conv2d_376 (Conv2D)              (None, 10, 10, 48)    20784       activation_180[0][0]             
____________________________________________________________________________________________________
conv2d_379 (Conv2D)              (None, 10, 10, 48)    13872       conv2d_378[0][0]                 
____________________________________________________________________________________________________
merge_6 (Merge)                  (None, 10, 10, 144)   0           max_pooling2d_48[0][0]           
                                                                   conv2d_376[0][0]                 
                                                                   conv2d_379[0][0]                 
____________________________________________________________________________________________________
conv2d_381 (Conv2D)              (None, 10, 10, 16)    2320        merge_6[0][0]                    
____________________________________________________________________________________________________
conv2d_382 (Conv2D)              (None, 10, 10, 20)    2260        conv2d_381[0][0]                 
____________________________________________________________________________________________________
conv2d_380 (Conv2D)              (None, 10, 10, 24)    3480        merge_6[0][0]                    
____________________________________________________________________________________________________
conv2d_383 (Conv2D)              (None, 10, 10, 24)    3384        conv2d_382[0][0]                 
____________________________________________________________________________________________________
merge_7 (Merge)                  (None, 10, 10, 48)    0           conv2d_380[0][0]                 
                                                                   conv2d_383[0][0]                 
____________________________________________________________________________________________________
conv2d_384 (Conv2D)              (None, 10, 10, 144)   7056        merge_7[0][0]                    
____________________________________________________________________________________________________
merge_8 (Merge)                  (None, 10, 10, 144)   0           merge_6[0][0]                    
                                                                   conv2d_384[0][0]                 
____________________________________________________________________________________________________
activation_181 (Activation)      (None, 10, 10, 144)   0           merge_8[0][0]                    
____________________________________________________________________________________________________
conv2d_389 (Conv2D)              (None, 10, 10, 32)    4640        activation_181[0][0]             
____________________________________________________________________________________________________
conv2d_385 (Conv2D)              (None, 10, 10, 32)    4640        activation_181[0][0]             
____________________________________________________________________________________________________
conv2d_387 (Conv2D)              (None, 10, 10, 32)    4640        activation_181[0][0]             
____________________________________________________________________________________________________
conv2d_390 (Conv2D)              (None, 10, 10, 36)    10404       conv2d_389[0][0]                 
____________________________________________________________________________________________________
max_pooling2d_49 (MaxPooling2D)  (None, 4, 4, 144)     0           activation_181[0][0]             
____________________________________________________________________________________________________
conv2d_386 (Conv2D)              (None, 4, 4, 36)      10404       conv2d_385[0][0]                 
____________________________________________________________________________________________________
conv2d_388 (Conv2D)              (None, 4, 4, 36)      10404       conv2d_387[0][0]                 
____________________________________________________________________________________________________
conv2d_391 (Conv2D)              (None, 4, 4, 40)      13000       conv2d_390[0][0]                 
____________________________________________________________________________________________________
merge_9 (Merge)                  (None, 4, 4, 256)     0           max_pooling2d_49[0][0]           
                                                                   conv2d_386[0][0]                 
                                                                   conv2d_388[0][0]                 
                                                                   conv2d_391[0][0]                 
____________________________________________________________________________________________________
conv2d_393 (Conv2D)              (None, 4, 4, 24)      6168        merge_9[0][0]                    
____________________________________________________________________________________________________
conv2d_394 (Conv2D)              (None, 4, 4, 28)      2044        conv2d_393[0][0]                 
____________________________________________________________________________________________________
conv2d_392 (Conv2D)              (None, 4, 4, 24)      6168        merge_9[0][0]                    
____________________________________________________________________________________________________
conv2d_395 (Conv2D)              (None, 4, 4, 32)      2720        conv2d_394[0][0]                 
____________________________________________________________________________________________________
merge_10 (Merge)                 (None, 4, 4, 56)      0           conv2d_392[0][0]                 
                                                                   conv2d_395[0][0]                 
____________________________________________________________________________________________________
conv2d_396 (Conv2D)              (None, 4, 4, 256)     14592       merge_10[0][0]                   
____________________________________________________________________________________________________
merge_11 (Merge)                 (None, 4, 4, 256)     0           merge_9[0][0]                    
                                                                   conv2d_396[0][0]                 
____________________________________________________________________________________________________
activation_182 (Activation)      (None, 4, 4, 256)     0           merge_11[0][0]                   
____________________________________________________________________________________________________
average_pooling2d_7 (AveragePool (None, 1, 1, 256)     0           activation_182[0][0]             
____________________________________________________________________________________________________
dropout_7 (Dropout)              (None, 1, 1, 256)     0           average_pooling2d_7[0][0]        
____________________________________________________________________________________________________
flatten_7 (Flatten)              (None, 256)           0           dropout_7[0][0]                  
____________________________________________________________________________________________________
dense_7 (Dense)                  (None, 10)            2570        flatten_7[0][0]                  
====================================================================================================
Total params: 168,220
Trainable params: 168,220
Non-trainable params: 0
____________________________________________________________________________________________________
