____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 32, 32, 3)     0                                            
____________________________________________________________________________________________________
conv2d_1 (Conv2D)                (None, 30, 30, 4)     112         input_1[0][0]                    
____________________________________________________________________________________________________
conv2d_2 (Conv2D)                (None, 28, 28, 4)     148         conv2d_1[0][0]                   
____________________________________________________________________________________________________
conv2d_3 (Conv2D)                (None, 28, 28, 8)     296         conv2d_2[0][0]                   
____________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)   (None, 26, 26, 8)     0           conv2d_3[0][0]                   
____________________________________________________________________________________________________
conv2d_4 (Conv2D)                (None, 26, 26, 12)    876         conv2d_3[0][0]                   
____________________________________________________________________________________________________
merge_1 (Merge)                  (None, 26, 26, 20)    0           max_pooling2d_1[0][0]            
                                                                   conv2d_4[0][0]                   
____________________________________________________________________________________________________
conv2d_7 (Conv2D)                (None, 26, 26, 8)     168         merge_1[0][0]                    
____________________________________________________________________________________________________
conv2d_8 (Conv2D)                (None, 26, 26, 8)     456         conv2d_7[0][0]                   
____________________________________________________________________________________________________
conv2d_5 (Conv2D)                (None, 26, 26, 8)     168         merge_1[0][0]                    
____________________________________________________________________________________________________
conv2d_9 (Conv2D)                (None, 26, 26, 8)     456         conv2d_8[0][0]                   
____________________________________________________________________________________________________
conv2d_6 (Conv2D)                (None, 24, 24, 12)    876         conv2d_5[0][0]                   
____________________________________________________________________________________________________
conv2d_10 (Conv2D)               (None, 24, 24, 12)    876         conv2d_9[0][0]                   
____________________________________________________________________________________________________
merge_2 (Merge)                  (None, 24, 24, 24)    0           conv2d_6[0][0]                   
                                                                   conv2d_10[0][0]                  
____________________________________________________________________________________________________
conv2d_11 (Conv2D)               (None, 22, 22, 24)    5208        merge_2[0][0]                    
____________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)   (None, 22, 22, 24)    0           merge_2[0][0]                    
____________________________________________________________________________________________________
merge_3 (Merge)                  (None, 22, 22, 48)    0           conv2d_11[0][0]                  
                                                                   max_pooling2d_2[0][0]            
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 22, 22, 48)    0           merge_3[0][0]                    
____________________________________________________________________________________________________
conv2d_15 (Conv2D)               (None, 22, 22, 4)     196         activation_1[0][0]               
____________________________________________________________________________________________________
conv2d_13 (Conv2D)               (None, 22, 22, 4)     196         activation_1[0][0]               
____________________________________________________________________________________________________
conv2d_16 (Conv2D)               (None, 22, 22, 6)     222         conv2d_15[0][0]                  
____________________________________________________________________________________________________
conv2d_12 (Conv2D)               (None, 22, 22, 4)     196         activation_1[0][0]               
____________________________________________________________________________________________________
conv2d_14 (Conv2D)               (None, 22, 22, 4)     148         conv2d_13[0][0]                  
____________________________________________________________________________________________________
conv2d_17 (Conv2D)               (None, 22, 22, 8)     440         conv2d_16[0][0]                  
____________________________________________________________________________________________________
merge_4 (Merge)                  (None, 22, 22, 16)    0           conv2d_12[0][0]                  
                                                                   conv2d_14[0][0]                  
                                                                   conv2d_17[0][0]                  
____________________________________________________________________________________________________
conv2d_18 (Conv2D)               (None, 22, 22, 48)    816         merge_4[0][0]                    
____________________________________________________________________________________________________
merge_5 (Merge)                  (None, 22, 22, 48)    0           activation_1[0][0]               
                                                                   conv2d_18[0][0]                  
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 22, 22, 48)    0           merge_5[0][0]                    
____________________________________________________________________________________________________
conv2d_20 (Conv2D)               (None, 22, 22, 32)    1568        activation_2[0][0]               
____________________________________________________________________________________________________
conv2d_21 (Conv2D)               (None, 22, 22, 32)    9248        conv2d_20[0][0]                  
____________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)   (None, 10, 10, 48)    0           activation_2[0][0]               
____________________________________________________________________________________________________
conv2d_19 (Conv2D)               (None, 10, 10, 48)    20784       activation_2[0][0]               
____________________________________________________________________________________________________
conv2d_22 (Conv2D)               (None, 10, 10, 48)    13872       conv2d_21[0][0]                  
____________________________________________________________________________________________________
merge_6 (Merge)                  (None, 10, 10, 144)   0           max_pooling2d_3[0][0]            
                                                                   conv2d_19[0][0]                  
                                                                   conv2d_22[0][0]                  
____________________________________________________________________________________________________
conv2d_24 (Conv2D)               (None, 10, 10, 16)    2320        merge_6[0][0]                    
____________________________________________________________________________________________________
conv2d_25 (Conv2D)               (None, 10, 10, 20)    2260        conv2d_24[0][0]                  
____________________________________________________________________________________________________
conv2d_23 (Conv2D)               (None, 10, 10, 24)    3480        merge_6[0][0]                    
____________________________________________________________________________________________________
conv2d_26 (Conv2D)               (None, 10, 10, 24)    3384        conv2d_25[0][0]                  
____________________________________________________________________________________________________
merge_7 (Merge)                  (None, 10, 10, 48)    0           conv2d_23[0][0]                  
                                                                   conv2d_26[0][0]                  
____________________________________________________________________________________________________
conv2d_27 (Conv2D)               (None, 10, 10, 144)   7056        merge_7[0][0]                    
____________________________________________________________________________________________________
merge_8 (Merge)                  (None, 10, 10, 144)   0           merge_6[0][0]                    
                                                                   conv2d_27[0][0]                  
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 10, 10, 144)   0           merge_8[0][0]                    
____________________________________________________________________________________________________
conv2d_32 (Conv2D)               (None, 10, 10, 32)    4640        activation_3[0][0]               
____________________________________________________________________________________________________
conv2d_28 (Conv2D)               (None, 10, 10, 32)    4640        activation_3[0][0]               
____________________________________________________________________________________________________
conv2d_30 (Conv2D)               (None, 10, 10, 32)    4640        activation_3[0][0]               
____________________________________________________________________________________________________
conv2d_33 (Conv2D)               (None, 10, 10, 36)    10404       conv2d_32[0][0]                  
____________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)   (None, 4, 4, 144)     0           activation_3[0][0]               
____________________________________________________________________________________________________
conv2d_29 (Conv2D)               (None, 4, 4, 36)      10404       conv2d_28[0][0]                  
____________________________________________________________________________________________________
conv2d_31 (Conv2D)               (None, 4, 4, 36)      10404       conv2d_30[0][0]                  
____________________________________________________________________________________________________
conv2d_34 (Conv2D)               (None, 4, 4, 40)      13000       conv2d_33[0][0]                  
____________________________________________________________________________________________________
merge_9 (Merge)                  (None, 4, 4, 256)     0           max_pooling2d_4[0][0]            
                                                                   conv2d_29[0][0]                  
                                                                   conv2d_31[0][0]                  
                                                                   conv2d_34[0][0]                  
____________________________________________________________________________________________________
conv2d_36 (Conv2D)               (None, 4, 4, 24)      6168        merge_9[0][0]                    
____________________________________________________________________________________________________
conv2d_37 (Conv2D)               (None, 4, 4, 28)      2044        conv2d_36[0][0]                  
____________________________________________________________________________________________________
conv2d_35 (Conv2D)               (None, 4, 4, 24)      6168        merge_9[0][0]                    
____________________________________________________________________________________________________
conv2d_38 (Conv2D)               (None, 4, 4, 32)      2720        conv2d_37[0][0]                  
____________________________________________________________________________________________________
merge_10 (Merge)                 (None, 4, 4, 56)      0           conv2d_35[0][0]                  
                                                                   conv2d_38[0][0]                  
____________________________________________________________________________________________________
conv2d_39 (Conv2D)               (None, 4, 4, 256)     14592       merge_10[0][0]                   
____________________________________________________________________________________________________
merge_11 (Merge)                 (None, 4, 4, 256)     0           merge_9[0][0]                    
                                                                   conv2d_39[0][0]                  
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 4, 4, 256)     0           merge_11[0][0]                   
____________________________________________________________________________________________________
average_pooling2d_1 (AveragePool (None, 1, 1, 256)     0           activation_4[0][0]               
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 1, 1, 256)     0           average_pooling2d_1[0][0]        
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 256)           0           dropout_1[0][0]                  
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 10)            2570        flatten_1[0][0]                  
====================================================================================================
Total params: 168,220
Trainable params: 168,220
Non-trainable params: 0
____________________________________________________________________________________________________
