____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_12 (InputLayer)            (None, 32, 32, 3)     0                                            
____________________________________________________________________________________________________
conv2d_247 (Conv2D)              (None, 30, 30, 4)     112         input_12[0][0]                   
____________________________________________________________________________________________________
conv2d_248 (Conv2D)              (None, 28, 28, 4)     148         conv2d_247[0][0]                 
____________________________________________________________________________________________________
conv2d_249 (Conv2D)              (None, 28, 28, 8)     296         conv2d_248[0][0]                 
____________________________________________________________________________________________________
max_pooling2d_28 (MaxPooling2D)  (None, 26, 26, 8)     0           conv2d_249[0][0]                 
____________________________________________________________________________________________________
conv2d_250 (Conv2D)              (None, 26, 26, 12)    876         conv2d_249[0][0]                 
____________________________________________________________________________________________________
concatenate_53 (Concatenate)     (None, 26, 26, 20)    0           max_pooling2d_28[0][0]           
                                                                   conv2d_250[0][0]                 
____________________________________________________________________________________________________
conv2d_253 (Conv2D)              (None, 26, 26, 8)     168         concatenate_53[0][0]             
____________________________________________________________________________________________________
conv2d_254 (Conv2D)              (None, 26, 26, 8)     456         conv2d_253[0][0]                 
____________________________________________________________________________________________________
conv2d_251 (Conv2D)              (None, 26, 26, 8)     168         concatenate_53[0][0]             
____________________________________________________________________________________________________
conv2d_255 (Conv2D)              (None, 26, 26, 8)     456         conv2d_254[0][0]                 
____________________________________________________________________________________________________
conv2d_252 (Conv2D)              (None, 24, 24, 12)    876         conv2d_251[0][0]                 
____________________________________________________________________________________________________
conv2d_256 (Conv2D)              (None, 24, 24, 12)    876         conv2d_255[0][0]                 
____________________________________________________________________________________________________
concatenate_54 (Concatenate)     (None, 24, 24, 24)    0           conv2d_252[0][0]                 
                                                                   conv2d_256[0][0]                 
____________________________________________________________________________________________________
conv2d_257 (Conv2D)              (None, 22, 22, 24)    5208        concatenate_54[0][0]             
____________________________________________________________________________________________________
max_pooling2d_29 (MaxPooling2D)  (None, 22, 22, 24)    0           concatenate_54[0][0]             
____________________________________________________________________________________________________
concatenate_55 (Concatenate)     (None, 22, 22, 48)    0           conv2d_257[0][0]                 
                                                                   max_pooling2d_29[0][0]           
____________________________________________________________________________________________________
activation_27 (Activation)       (None, 22, 22, 48)    0           concatenate_55[0][0]             
____________________________________________________________________________________________________
conv2d_261 (Conv2D)              (None, 22, 22, 4)     196         activation_27[0][0]              
____________________________________________________________________________________________________
conv2d_259 (Conv2D)              (None, 22, 22, 4)     196         activation_27[0][0]              
____________________________________________________________________________________________________
conv2d_262 (Conv2D)              (None, 22, 22, 6)     222         conv2d_261[0][0]                 
____________________________________________________________________________________________________
conv2d_258 (Conv2D)              (None, 22, 22, 4)     196         activation_27[0][0]              
____________________________________________________________________________________________________
conv2d_260 (Conv2D)              (None, 22, 22, 4)     148         conv2d_259[0][0]                 
____________________________________________________________________________________________________
conv2d_263 (Conv2D)              (None, 22, 22, 8)     440         conv2d_262[0][0]                 
____________________________________________________________________________________________________
concatenate_56 (Concatenate)     (None, 22, 22, 16)    0           conv2d_258[0][0]                 
                                                                   conv2d_260[0][0]                 
                                                                   conv2d_263[0][0]                 
____________________________________________________________________________________________________
conv2d_264 (Conv2D)              (None, 22, 22, 48)    816         concatenate_56[0][0]             
____________________________________________________________________________________________________
add_19 (Add)                     (None, 22, 22, 48)    0           activation_27[0][0]              
                                                                   conv2d_264[0][0]                 
____________________________________________________________________________________________________
activation_28 (Activation)       (None, 22, 22, 48)    0           add_19[0][0]                     
____________________________________________________________________________________________________
average_pooling2d_8 (AveragePool (None, 19, 19, 48)    0           activation_28[0][0]              
____________________________________________________________________________________________________
dropout_8 (Dropout)              (None, 19, 19, 48)    0           average_pooling2d_8[0][0]        
____________________________________________________________________________________________________
flatten_8 (Flatten)              (None, 17328)         0           dropout_8[0][0]                  
____________________________________________________________________________________________________
dense_8 (Dense)                  (None, 10)            173290      flatten_8[0][0]                  
====================================================================================================
Total params: 185,144
Trainable params: 185,144
Non-trainable params: 0
____________________________________________________________________________________________________
