____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_4 (InputLayer)             (None, 32, 32, 3)     0                                            
____________________________________________________________________________________________________
conv2d_16 (Conv2D)               (None, 30, 30, 4)     112         input_4[0][0]                    
____________________________________________________________________________________________________
conv2d_17 (Conv2D)               (None, 28, 28, 4)     148         conv2d_16[0][0]                  
____________________________________________________________________________________________________
conv2d_18 (Conv2D)               (None, 28, 28, 8)     296         conv2d_17[0][0]                  
____________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)   (None, 26, 26, 8)     0           conv2d_18[0][0]                  
____________________________________________________________________________________________________
conv2d_19 (Conv2D)               (None, 26, 26, 12)    876         conv2d_18[0][0]                  
____________________________________________________________________________________________________
concatenate_5 (Concatenate)      (None, 26, 26, 20)    0           max_pooling2d_4[0][0]            
                                                                   conv2d_19[0][0]                  
____________________________________________________________________________________________________
conv2d_22 (Conv2D)               (None, 26, 26, 8)     168         concatenate_5[0][0]              
____________________________________________________________________________________________________
conv2d_23 (Conv2D)               (None, 26, 26, 8)     456         conv2d_22[0][0]                  
____________________________________________________________________________________________________
conv2d_20 (Conv2D)               (None, 26, 26, 8)     168         concatenate_5[0][0]              
____________________________________________________________________________________________________
conv2d_24 (Conv2D)               (None, 26, 26, 8)     456         conv2d_23[0][0]                  
____________________________________________________________________________________________________
conv2d_21 (Conv2D)               (None, 24, 24, 12)    876         conv2d_20[0][0]                  
____________________________________________________________________________________________________
conv2d_25 (Conv2D)               (None, 24, 24, 12)    876         conv2d_24[0][0]                  
____________________________________________________________________________________________________
concatenate_6 (Concatenate)      (None, 24, 24, 24)    0           conv2d_21[0][0]                  
                                                                   conv2d_25[0][0]                  
____________________________________________________________________________________________________
conv2d_26 (Conv2D)               (None, 22, 22, 24)    5208        concatenate_6[0][0]              
____________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)   (None, 22, 22, 24)    0           concatenate_6[0][0]              
____________________________________________________________________________________________________
concatenate_7 (Concatenate)      (None, 22, 22, 48)    0           conv2d_26[0][0]                  
                                                                   max_pooling2d_5[0][0]            
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 22, 22, 48)    0           concatenate_7[0][0]              
____________________________________________________________________________________________________
conv2d_30 (Conv2D)               (None, 22, 22, 4)     196         activation_3[0][0]               
____________________________________________________________________________________________________
conv2d_28 (Conv2D)               (None, 22, 22, 4)     196         activation_3[0][0]               
____________________________________________________________________________________________________
conv2d_31 (Conv2D)               (None, 22, 22, 6)     222         conv2d_30[0][0]                  
____________________________________________________________________________________________________
conv2d_27 (Conv2D)               (None, 22, 22, 4)     196         activation_3[0][0]               
____________________________________________________________________________________________________
conv2d_29 (Conv2D)               (None, 22, 22, 4)     148         conv2d_28[0][0]                  
____________________________________________________________________________________________________
conv2d_32 (Conv2D)               (None, 22, 22, 8)     440         conv2d_31[0][0]                  
____________________________________________________________________________________________________
concatenate_8 (Concatenate)      (None, 22, 22, 16)    0           conv2d_27[0][0]                  
                                                                   conv2d_29[0][0]                  
                                                                   conv2d_32[0][0]                  
____________________________________________________________________________________________________
conv2d_33 (Conv2D)               (None, 22, 22, 48)    816         concatenate_8[0][0]              
____________________________________________________________________________________________________
add_1 (Add)                      (None, 22, 22, 48)    0           activation_3[0][0]               
                                                                   conv2d_33[0][0]                  
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 22, 22, 48)    0           add_1[0][0]                      
____________________________________________________________________________________________________
average_pooling2d_2 (AveragePool (None, 19, 19, 48)    0           activation_4[0][0]               
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 19, 19, 48)    0           average_pooling2d_2[0][0]        
____________________________________________________________________________________________________
flatten_2 (Flatten)              (None, 17328)         0           dropout_2[0][0]                  
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 10)            173290      flatten_2[0][0]                  
====================================================================================================
Total params: 185,144
Trainable params: 185,144
Non-trainable params: 0
____________________________________________________________________________________________________
